GHB2/src/Documents/гхб_ЗакреплениеСтатусаКонсервацииПомещения/гхб_ЗакреплениеСтатусаКонсервацииПомещения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гхб_ЗакреплениеСтатусаКонсервацииПомещения</name>
  <registerRecords>InformationRegister.гхб_СтатусыКонсервацииПомещений</registerRecords>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусКонсервации</name>
    <type>
      <types>EnumRef.гхб_СтатусыКонсервацииПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПомощьАХО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомощьIT</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПомощьНеНужна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СнятьПроверкуДатыНачала</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеСозданиеДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонсервации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонсервацииСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

GHB2/src/InformationRegisters/гхб_АктуальныеДокументыКонсервацииПомещений/гхб_АктуальныеДокументыКонсервацииПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_АктуальныеДокументыКонсервацииПомещений</name>
  <attributes>
    <name>ДокументКонсервации</name>
    <type>
      <types>DocumentRef.гхб_ЗакреплениеСтатусаКонсервацииПомещения</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/InformationRegisters/гхб_СтатусыКонсервацииПомещений/гхб_СтатусыКонсервацииПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гхб_СтатусыКонсервацииПомещений</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>СтатусКонсервации</name>
    <type>
      <types>EnumRef.гхб_СтатусыКонсервацииПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонсервации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодКонсервацииСтрока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.гхб_Помещения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

GHB2/src/Enums/гхб_ТипыСобытийОбъектовБД/гхб_ТипыСобытийОбъектовБД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гхб_ТипыСобытийОбъектовБД</name>
  <enumValues>
    <name>ПервоеПроведениеДокумента</name>
  </enumValues>
  <enumValues>
    <name>ПересчетПлощадиПомещений</name>
  </enumValues>
  <enumValues>
    <name>ПланируемаяБлокировкаПользователя</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеПриПроведении</name>
  </enumValues>
  <enumValues>
    <name>РассылкаПоСтатусамКонсервацииПомещений</name>
  </enumValues>
</mdclass:Enum>

GHB2/src/Catalogs/гхб_СлужебныеЗначения/гхб_СлужебныеЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гхб_СлужебныеЗначения</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Администрирование</name>
      <description>Администрирование</description>
    </items>
    <items>
      <name>МобильнаяСвязь</name>
      <description>Мобильная связь</description>
    </items>
    <items>
      <name>ОбменДанными</name>
      <description>Обмен данными</description>
    </items>
    <items>
      <name>Помещения</name>
      <description>Помещения</description>
    </items>
    <items>
      <name>Пропуска</name>
      <description>Пропуска</description>
    </items>
    <items>
      <name>ПутиКФайлам</name>
      <description>Пути к файлам</description>
    </items>
    <items>
      <name>СервисДеск</name>
      <description>Сервис деск</description>
    </items>
    <items>
      <name>ЭлектроннаяПочта</name>
      <description>Электронная почта</description>
    </items>
  </predefined>
  <attributes>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>7</scale>
      </numberQualifiers>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтрокаНеограничена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

GHB2/src/Documents/гхб_ЗакреплениеСтатусаКонсервацииПомещения/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(гхб_Ответственный) Тогда
		гхб_Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	гхб_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
         Возврат;
	КонецЕсли;
	 
	Если (РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
		
		//Если (АвтоматическоеСозданиеДокумента ИЛИ (НачалоДня(Дата) < НачалоДня(ТекущаяДатаСеанса()))) И НЕ РольДоступна(Метаданные.Роли.ПолныеПрава) Тогда
		//	Отказ = Истина;
		//Иначе	
			РегистрыСведений.гхб_АктуальныеДокументыКонсервацииПомещений.УдалитьЗаписиПоДокументуИПересчитатьДанные(Ссылка);
		//КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Если (НачалоДня(Дата) >= НачалоДня(ТекущаяДатаСеанса())) Тогда
	
		_Движение = Движения.гхб_СтатусыКонсервацииПомещений.Добавить();
		_Движение.Период = Дата;
		_Движение.Регистратор = Ссылка;
		_Движение.Помещение = Помещение;
		_Движение.СтатусКонсервации = СтатусКонсервации;
		_Движение.ДатаНачала = ДатаНачала;
		_Движение.ДатаОкончания = ДатаОкончания;
		_Движение.ПериодКонсервации = ПериодКонсервации;
		_Движение.ПериодКонсервацииСтрока = ПериодКонсервацииСтрока;
			
		Движения.гхб_СтатусыКонсервацииПомещений.Записать();
		
		РегистрыСведений.гхб_АктуальныеДокументыКонсервацииПомещений.ЗаписатьДанныеПоДокументу(Ссылка, Помещение, ДатаНачала, ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, гхб_ОбщегоНазначенияКлиентСервер.ДобавитьДеньКДате(ДатаНачала, 6)));
		
		Если НЕ РегистрыСведений.гхб_СобытияОбъектовБД.СобытиеПоОбъектуБыло(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.УведомлениеПриПроведении) Тогда
			ОтправитьПисьмоНаСервисДеск();
			РегистрыСведений.гхб_СобытияОбъектовБД.ЗаписатьДанныеСобытияОбъекта(Ссылка, Перечисления.гхб_ТипыСобытийОбъектовБД.УведомлениеПриПроведении);
		КонецЕсли;
		
	//КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьПисьмоНаСервисДеск()
	
	Если ПомощьIT ИЛИ ПомощьАХО Тогда
		
		_Адрес = Справочники.гхб_СлужебныеЗначения.ПочтовыйЯщикServiceDesk.Значение;
		
		Если ЗначениеЗаполнено(_Адрес) Тогда 
			
			Если ПомощьIT И ПомощьАХО Тогда
				_СтрокаПомощь = "АХО и IT";
				_СтрокаПолнаяПомощь = "Помощь АХО<br>Помощь IT";
			ИначеЕсли ПомощьАХО Тогда
				_СтрокаПомощь = "АХО";
				_СтрокаПолнаяПомощь = "Помощь АХО";
			Иначе
				_СтрокаПомощь = "IT";
				_СтрокаПолнаяПомощь = "Помощь IT";
			КонецЕсли;
				
			_Текст = "<p>Добрый день!<br>
				|Для помещения изменен статус консервации и необходимо создать заявки на помощь " + _СтрокаПомощь + "</p>
				|<table border=""0"">
				|<tbody>
				|<tr>
				|<td align=""left"" valign=""top""><b>Помещение:</b></td>
				|<td align=""left"" valign=""top"">" + СокрЛП(Помещение) + "</td>
				|</tr>
				|<tr>
				|<td align=""left"" valign=""top""><b>Ответственный за консервацию помещения:</b></td>
				|<td align=""left"" valign=""top"">" + СокрЛП(гхб_Ответственный) + "</td>
				|</tr>
				|<tr>
				|<td align=""left"" valign=""top""><b>Статус консервации:</b></td>
				|<td align=""left"" valign=""top"">" + СокрЛП(СтатусКонсервации) + "</td>
				|</tr>
				|<tr>
				|<td align=""left"" valign=""top""><b>Дата изменения статуса консервации:</b></td>
				|<td align=""left"" valign=""top"">" + Формат(ДатаНачала, "ДФ=dd.MM.yyyy") + "</td>
				|</tr>
				|<tr>
				|<td align=""left"" valign=""top""><b>Период консервации:</b></td>
				|<td align=""left"" valign=""top"">" + ПериодКонсервацииСтрока + "</td>
				|</tr>
				|<tr>
				|<td align=""left"" valign=""top""><b>Дата окончания действия статуса консервации:</b></td>
				|<td align=""left"" valign=""top"">" + Формат(ДатаОкончания, "ДФ=dd.MM.yyyy") + "</td>
				|</tr>
				|<tr>
				|<td align=""left"" valign=""top""><b>Привлечение сервисных служб:</b></td>
				|<td align=""left"" valign=""top"">" + _СтрокаПолнаяПомощь + "</td>
				|</tr>
				|</tbody>
				|</table>";
				
			_Тема = гхб_ВзаимодействияСервер.СформироватьСтандартнуюТемуПисьма("Изменен статус консервации для помещения");
			
			гхб_ВзаимодействияСервер.СоздатьЭлектронноеПисьмо(_Адрес, _Тема, _Текст);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
